Documents/ВводПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ЗаданияНаСнятиеПоказанийПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраничнаяДатаСъема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПериодРасчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрупповоеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаменыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаменыПриборовУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СнятыеПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СнятыеПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчетаССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчетаССайта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПУИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПУИзВнешнихИсточников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводПоказанийПриборовУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.ОбъектУстановки КАК ОбъектУстановки,
		|	ВложенныйЗапрос.ПоказаниеПредыдущее,
		|	ВложенныйЗапрос.ВидТарифа,
		|	ВложенныйЗапрос.Услуга,
		|	ВложенныйЗапрос.Показание,
		|	ВложенныйЗапрос.Отключен КАК Отключен,
		|	ВложенныйЗапрос.ОбъектЛицевогоСчета,
		|	ВложенныйЗапрос.Коэффициент,
		|	ВложенныйЗапрос.ОтветственныйВладелец,
		|	ВложенныйЗапрос.Период,
		|	ЕСТЬNULL(ВложенныйЗапрос.СреднемесячноеПоказание, 0) КАК СреднемесячноеПоказание
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.ОбъектУстановки КАК ОбъектУстановки,
		|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|		ВложенныйЗапрос.Услуга КАК Услуга,
		|		ВложенныйЗапрос.ВидТарифа КАК ВидТарифа,
		|		ВложенныйЗапрос.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущее,
		|		ВложенныйЗапрос.ПоказаниеОборот КАК Показание,
		|		ИСТИНА КАК Отключен,
		|		ВложенныйЗапрос.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|		ВложенныйЗапрос.Коэффициент КАК Коэффициент,
		|		ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
		|		ВложенныйЗапрос.СреднемесячноеПоказаниеОборот КАК СреднемесячноеПоказание,
		|		ВложенныйЗапрос.Период КАК Период
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЗаменыПриборовУчетаОбороты.ОбъектУстановки КАК ОбъектУстановки,
		|			ЗаменыПриборовУчетаОбороты.ПриборУчета КАК ПриборУчета,
		|			ЗаменыПриборовУчетаОбороты.Услуга КАК Услуга,
		|			ЗаменыПриборовУчетаОбороты.ВидТарифа КАК ВидТарифа,
		|			ЗаменыПриборовУчетаОбороты.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущееОборот,
		|			ЗаменыПриборовУчетаОбороты.ПоказаниеОборот КАК ПоказаниеОборот,
		|			ЗаменыПриборовУчетаОбороты.СреднемесячноеПоказаниеОборот КАК СреднемесячноеПоказаниеОборот,
		|			ЗаменыПриборовУчетаОбороты.Период КАК Период,
		|			ЗаменыПриборовУчетаОбороты.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|			ЗаменыПриборовУчетаОбороты.ПриборУчета.Коэффициент КАК Коэффициент
		|		ИЗ
		|			РегистрНакопления.ЗаменыПриборовУчета.Обороты(
		|					&НачПериода,
		|					&КонПериода,
		|					Месяц,
		|					ОбъектУстановки В (&ОбъектыУстановки)
		|						И ПриборУчета.Услуга = &Услуга) КАК ЗаменыПриборовУчетаОбороты) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&КонПериода, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|			ПО ВложенныйЗапрос.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|		ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Услуга,
		|		ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
		|		ПоказанияПриборовУчетаСрезПоследних.Значение,
		|		0,
		|		ЛОЖЬ,
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент,
		|		ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|		0,
		|		ПоказанияПриборовУчетаСрезПоследних.Период
		|	ИЗ
		|		РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|				&КонПериода,
		|				ОбъектУстановки В (&ОбъектыУстановки)
		|					И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&КонПериода, Регистратор <> &Ссылка) КАК ПоказанияПриборовУчетаСрезПоследних
		|			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&КонПериода, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|			ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|	ГДЕ
		|		УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектУстановки,
		|	Отключен УБЫВ,
		|	ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОтключения,
		|	ЕСТЬNULL(НАПоверке.СреднемесячноеПоказание, 0) КАК СреднемесячноеПоказание,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВключения,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|					И ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|							ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|							И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|						ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|									И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, 0) КАК ДнейПоСредней,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), ДЕНЬ) КАК ДнейВМесяце,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|			&КонПериода,
		|			Действует = ИСТИНА
		|				И ОбъектУстановки В (&ОбъектыУстановки)
		|				И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|				&КонПериода,
		|				Действует = ЛОЖЬ
		|					И ЕСТЬNULL(СреднемесячноеПоказание, 0) <> 0
		|					И ОбъектУстановки В (&ОбъектыУстановки)
		|					И ПриборУчета.Услуга = &Услуга) КАК НАПоверке
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = НАПоверке.ОбъектУстановки
		|			И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = НАПоверке.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	НАПоверке.СреднемесячноеПоказание <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета";
		
	Запрос.Параметры.Вставить("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.Параметры.Вставить("КонПериода", КонецМесяца(Объект.ПериодНачисления));
	
	Запрос.Параметры.Вставить("ОбъектыУстановки", МассивОбъектовУстановки);
	Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	Результат  = Запрос.ВыполнитьПакет();
	
	ВыборкаЛС = Результат[0].Выбрать(); 
	ВыборкаПоверок = Результат[1].Выбрать();
	Разница = 0;
	ПриборУчетаКонтроль = Неопределено;
	Пока ВыборкаЛС.Следующий() Цикл
				
		НоваяСтрока = Объект.Основная.Добавить();
		НоваяСтрока.ОбъектУстановки = ВыборкаЛС.ОбъектУстановки;
		НоваяСтрока.ПриборУчета = ВыборкаЛС.ПриборУчета;
		НоваяСтрока.ПоказаниеПредыдущее = ВыборкаЛС.ПоказаниеПредыдущее;
		НоваяСтрока.Показание = ВыборкаЛС.Показание;
		НоваяСтрока.Коэффициент = ВыборкаЛС.Коэффициент;
		НоваяСтрока.Отключен = ВыборкаЛС.Отключен;
		НоваяСтрока.ВидТарифа = ВыборкаЛС.ВидТарифа;
		НоваяСтрока.Услуга = ВыборкаЛС.Услуга;
		НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаЛС.ОбъектЛицевогоСчета;
		НоваяСтрока.ОтветственныйВладелец = ВыборкаЛС.ОтветственныйВладелец;
		НоваяСтрока.Разница = НоваяСтрока.Показание - НоваяСтрока.ПоказаниеПредыдущее;
				
	КонецЦикла;
	
	Для Индекс = 0 По МассивОбъектовУстановки.ВГраница() Цикл
	
		НайденаПоверка = ВыборкаПоверок.НайтиСледующий(МассивОбъектовУстановки[индекс]);
		Если НайденаПоверка и ВыборкаПоверок.ДнейПоСредней <> 0 Тогда
			
		     
				НоваяСтрока = Объект.Основная.Добавить();
				НоваяСтрока.ОбъектУстановки = ВыборкаПоверок.ОбъектУстановки;
				НоваяСтрока.ПриборУчета = ВыборкаПоверок.ПриборУчета;
				НоваяСтрока.Коэффициент = ВыборкаПоверок.ПриборУчета.Коэффициент;
				НоваяСтрока.Отключен = Истина;
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Услуга =  ВыборкаПоверок.ПриборУчета.Услуга;
				НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаПоверок.ОбъектУстановки.ОбъектЛицевогоСчета;
				НоваяСтрока.ОтветственныйВладелец = ВыборкаПоверок.ОтветственныйВладелец;
				Разница = Окр((ВыборкаПоверок.СреднемесячноеПоказание/(ВыборкаПоверок.ДнейВМесяце+1)*(ВыборкаПоверок.ДнейПоСредней+1)),4);
				НоваяСтрока.Разница =  Разница;

		 КонецЕсли;  
	
	КонецЦикла; 
		
	Объект.Основная.Сортировать("ОбъектУстановки, ПриборУчета, Отключен Убыв");   
	
	Для каждого СтрокаОсновная Из Объект.Основная Цикл
		
		Если СтрокаОсновная.Показание = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", СтрокаОсновная.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", СтрокаОсновная.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", СтрокаОсновная.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		СтрокаОсновная.Разница = СтруктураДанные.РасходПоПриборуУчета;
		СтрокаОсновная.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		СтрокаОсновная.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
	
	КонецЦикла; 	
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

&НаСервере
Процедура ЗаполнитьПриборыУчета(ПриборУчета = Неопределено)
	
	Если ПриборУчета = Неопределено Тогда
		ТаблицаПриборыУчета = Объект.Основная.Выгрузить();
		ТаблицаПриборыУчета.Свернуть("ПриборУчета",);
		МассивПриборыУчета = ТаблицаПриборыУчета.ВыгрузитьКолонку("ПриборУчета"); 
		
	Иначе
		МассивПриборыУчета = Новый Массив;
		МассивПриборыУчета.Добавить(ПриборУчета);		
	КонецЕсли;	
	
	ТаблицаПерезаполнить = Объект.Основная.Выгрузить();
	ТаблицаПерезаполнить.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.ОбъектУстановки КАК ОбъектУстановки,
		|	ВложенныйЗапрос.ПоказаниеПредыдущее,
		|	ВложенныйЗапрос.ВидТарифа,
		|	ВложенныйЗапрос.Услуга,
		|	ВложенныйЗапрос.Показание,
		|	ВложенныйЗапрос.Отключен КАК Отключен,
		|	ВложенныйЗапрос.ОбъектЛицевогоСчета,
		|	ВложенныйЗапрос.Коэффициент,
		|	ВложенныйЗапрос.ОтветственныйВладелец
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаменыПриборовУчетаОбороты.ОбъектУстановки КАК ОбъектУстановки,
		|		ЗаменыПриборовУчетаОбороты.ПриборУчета КАК ПриборУчета,
		|		ЗаменыПриборовУчетаОбороты.Услуга КАК Услуга,
		|		ЗаменыПриборовУчетаОбороты.ВидТарифа КАК ВидТарифа,
		|		ЗаменыПриборовУчетаОбороты.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущее,
		|		ЗаменыПриборовУчетаОбороты.ПоказаниеОборот КАК Показание,
		|		ИСТИНА КАК Отключен,
		|		ЗаменыПриборовУчетаОбороты.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|		ЗаменыПриборовУчетаОбороты.ПриборУчета.Коэффициент КАК Коэффициент,
		|		ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец
		|	ИЗ
		|		РегистрНакопления.ЗаменыПриборовУчета.Обороты(&НачПериода, &КонПериода, Месяц, ПриборУчета В (&ПриборыУчета)) КАК ЗаменыПриборовУчетаОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&КонПериода, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|			ПО ЗаменыПриборовУчетаОбороты.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|		ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Услуга,
		|		ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
		|		ПоказанияПриборовУчетаСрезПоследних.Значение,
		|		0,
		|		ЛОЖЬ,
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент,
		|		ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|	ИЗ
		|		РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&КонПериода, ПриборУчета В (&ПриборыУчета)) КАК УстановленныеПриборыУчетаСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&КонПериода, Регистратор <> &Ссылка) КАК ПоказанияПриборовУчетаСрезПоследних
		|			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&КонПериода, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|			ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|	ГДЕ
		|		УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектУстановки,
		|	Отключен УБЫВ,
		|	ПриборУчета";
		
		
	Запрос.Параметры.Вставить("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.Параметры.Вставить("КонПериода", КонецМесяца(Объект.ПериодНачисления));
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	Запрос.Параметры.Вставить("ПриборыУчета", МассивПриборыУчета);
	
	
	ВыборкаЛС = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПерезаполнить.Добавить();
		НоваяСтрока.ОбъектУстановки = ВыборкаЛС.ОбъектУстановки;
		НоваяСтрока.ПриборУчета = ВыборкаЛС.ПриборУчета;
		НоваяСтрока.ПоказаниеПредыдущее = ВыборкаЛС.ПоказаниеПредыдущее;
		НоваяСтрока.Показание = ВыборкаЛС.Показание;
		НоваяСтрока.Коэффициент = ВыборкаЛС.Коэффициент;
		НоваяСтрока.Отключен = ВыборкаЛС.Отключен;
		НоваяСтрока.ВидТарифа = ВыборкаЛС.ВидТарифа;
		НоваяСтрока.Услуга = ВыборкаЛС.Услуга;
		НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаЛС.ОбъектЛицевогоСчета;
		НоваяСтрока.ОтветственныйВладелец = ВыборкаЛС.ОтветственныйВладелец;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицаПерезаполнить Из ТаблицаПерезаполнить Цикл
		
		МассивСтрок = Объект.Основная.НайтиСтроки(Новый Структура("ПриборУчета", СтрокаТаблицаПерезаполнить.ПриборУчета));
		
		Если МассивСтрок.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(МассивСтрок[0], СтрокаТаблицаПерезаполнить, ,"Показание");
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ПриборУчета", МассивСтрок[0].ПриборУчета);
			СтруктураДанные.Вставить("ПредыдущееПоказание", МассивСтрок[0].ПоказаниеПредыдущее);
			СтруктураДанные.Вставить("ТекущееПоказание", МассивСтрок[0].Показание);
			
			СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
			
			МассивСтрок[0].Разница = СтруктураДанные.РасходПоПриборуУчета;
			МассивСтрок[0].ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
			МассивСтрок[0].РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	
	Если Объект.Основная.Количество() = 0 Тогда
		Элементы.Организация.ТолькоПросмотр = Ложь;	
		Элементы.Здание.ТолькоПросмотр = Ложь;	
		Элементы.Услуга.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Организация.ТолькоПросмотр = Истина;	
		Элементы.Здание.ТолькоПросмотр = Истина;	
		Элементы.Услуга.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	ЕстьНезаполненныеПоказания = ЛОжь;
	
	//Кнопки командной панели формы
	ПровестиИЗакрыть = КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть;
	ЗаписатьИЗакрыть = КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьИЗакрыть;
	
	Если Объект.Основная.Количество() = 0 тогда
		ПровестиИЗакрыть.КнопкаПоУмолчанию = Ложь;
		ПровестиИЗакрыть.Видимость = Ложь;
		
		
		ЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
		ЗаписатьИЗакрыть.Видимость = Истина;
	Иначе
		Для каждого Строка  Из Объект.Основная  Цикл
			
			
			Если Строка.Разница < 0 Тогда
				
				ПровестиИЗакрыть.КнопкаПоУмолчанию = Ложь;
				ПровестиИЗакрыть.Видимость = Ложь;
				
				ЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
				ЗаписатьИЗакрыть.Видимость = Истина;
				
				ЕстьНезаполненныеПоказания = Истина;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЕстьНезаполненныеПоказания Тогда
			ПровестиИЗакрыть.КнопкаПоУмолчанию  = Истина;
			ПровестиИЗакрыть.Видимость = Истина;
			
			ЗаписатьИЗакрыть.КнопкаПоУмолчанию = Ложь;
			ЗаписатьИЗакрыть.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры // УстановитьВидимостьИДоступность()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере. 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьМобильноеПриложение") Тогда
		Элементы.ЗаполнитьПоказанияСМоб.Видимость = Ложь;	
	КонецЕсли;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
	УстановитьВидимостьИДоступность();
    
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Для полной очистки табличной части нажмите ""Да"", 
						|Для добавления строк в табличной части нажмите ""Нет"",
						|иначе ""Отмена""';uk='Для полной очистки табличной части нажмите ""Да"",
						|Для добавления строк в табличной части нажмите ""Нет"",						
						|иначе ""Отмена""'"),
		                      РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Основная.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

// Процедура - обработчик команды ЗаполнитьАвтоматически.
//
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
	
		ТекстПредупреждения = НСтр("ru='Реквизит ""Здание"" не заполнен.';uk='Реквізит ""Будівля"" не заповнено.'"); 
		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	Если Объект.Основная.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru='Таблица показаний приборов учета будет перезаполнена, продолжить?';uk='Таблиця показань приладів обліку буде перенаповнений, продовжити?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние(НСтр("ru='Идет заполнение ..."
"Пожалуйста, подождите.';uk='Йде заповнення ..."
"Будь ласка, зачекайте.'"));
	
	Объект.Основная.Очистить();
	
	ЗаполнитьАвтоматическиНаСервере();

	УстановитьВидимостьИДоступность();

	Состояние(НСтр("ru='Заполнение завершено.';uk='Заповнення завершено.'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаменыПриборовУчетаОбороты.ОбъектУстановки КАК ОбъектУстановки,
		|	ЗаменыПриборовУчетаОбороты.ПриборУчета КАК ПриборУчета,
		|	ЗаменыПриборовУчетаОбороты.Услуга КАК Услуга,
		|	ЗаменыПриборовУчетаОбороты.ВидТарифа КАК ВидТарифа,
		|	ЗаменыПриборовУчетаОбороты.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущееОборот,
		|	ЗаменыПриборовУчетаОбороты.ПоказаниеОборот КАК ПоказаниеОборот,
		|	ЕСТЬNULL(ЗаменыПриборовУчетаОбороты.СреднемесячноеПоказаниеОборот, 0) КАК СреднемесячноеПоказаниеОборот,
		|	ЗаменыПриборовУчетаОбороты.Период КАК Период,
		|	ЗаменыПриборовУчетаОбороты.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	ЗаменыПриборовУчетаОбороты.ПриборУчета.Коэффициент КАК Коэффициент
		|ПОМЕСТИТЬ Замена
		|ИЗ
		|	РегистрНакопления.ЗаменыПриборовУчета.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			Месяц,
		|			ОбъектУстановки.Владелец = &Здание
		|				И ПриборУчета.Услуга = &Услуга) КАК ЗаменыПриборовУчетаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Замена.ОбъектУстановки,
		|	Замена.ПриборУчета,
		|	Замена.Услуга,
		|	Замена.ВидТарифа,
		|	Замена.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущее,
		|	Замена.ПоказаниеОборот КАК Показание,
		|	Замена.СреднемесячноеПоказаниеОборот КАК СреднемесячноеПоказание,
		|	Замена.Период,
		|	Замена.ОбъектЛицевогоСчета,
		|	Замена.Коэффициент,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ИСТИНА КАК Отключен
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	Замена КАК Замена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
		|				&КонПериода,
		|				ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						Замена.ОбъектУстановки
		|					ИЗ
		|						Замена КАК Замена)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО Замена.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.Период,
		|	УстановленныеПриборыУчетаСрезПоследних.Регистратор,
		|	УстановленныеПриборыУчетаСрезПоследних.НомерСтроки,
		|	УстановленныеПриборыУчетаСрезПоследних.Активность,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.Действует,
		|	УстановленныеПриборыУчетаСрезПоследних.СреднемесячноеПоказание
		|ПОМЕСТИТЬ УстПУ
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|			&КонПериода,
		|			ОбъектУстановки.Владелец = &Здание
		|				И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстПУ.ОбъектУстановки,
		|	УстПУ.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Услуга,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	0 КАК ПоказаниеПредыдущее,
		|	ЛОЖЬ КАК Отключен,
		|	УстПУ.ОбъектУстановки.ОбъектЛицевогоСчета,
		|	УстПУ.ПриборУчета.Коэффициент,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	0 КАК СреднемесячноеПоказание,
		|	ПоказанияПриборовУчетаСрезПоследних.Период
		|ПОМЕСТИТЬ ВТ_тек
		|ИЗ
		|	УстПУ КАК УстПУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
		|				&КонПериода,
		|				Регистратор <> &Ссылка
		|					И ПриборУчета.Услуга = &Услуга
		|					И ПриборУчета В
		|						(ВЫБРАТЬ
		|							УстПУ.ПриборУчета
		|						ИЗ
		|							УстПУ КАК УстПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО УстПУ.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
		|				&КонПериода,
		|				ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						УстПУ.ОбъектУстановки
		|					ИЗ
		|						УстПУ КАК УстПУ)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстПУ.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	УстПУ.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.ОбъектУстановки,
		|	ВТ2.ПриборУчета,
		|	ВТ2.Услуга,
		|	ВТ2.ВидТарифа,
		|	ВТ2.ПоказаниеПредыдущее,
		|	ВТ2.Показание,
		|	ВТ2.СреднемесячноеПоказание,
		|	ВТ2.Период,
		|	ВТ2.ОбъектЛицевогоСчета,
		|	ВТ2.Коэффициент,
		|	ВТ2.ОтветственныйВладелец,
		|	ВТ2.Отключен
		|ИЗ
		|	ВТ2 КАК ВТ2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_тек.ОбъектУстановки,
		|	ВТ_тек.ПриборУчета,
		|	ВТ_тек.ПриборУчетаУслуга,
		|	ВТ_тек.ВидТарифа,
		|	ВТ_тек.Значение,
		|	ВТ_тек.ПоказаниеПредыдущее,
		|	ВТ_тек.СреднемесячноеПоказание,
		|	ВТ_тек.Период,
		|	ВТ_тек.ОбъектУстановкиОбъектЛицевогоСчета,
		|	ВТ_тек.ПриборУчетаКоэффициент,
		|	ВТ_тек.ОтветственныйВладелец,
		|	ВТ_тек.Отключен
		|ИЗ
		|	ВТ_тек КАК ВТ_тек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОтключения,
		|	ЕСТЬNULL(НАПоверке.СреднемесячноеПоказание, 0) КАК СреднемесячноеПоказание,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВключения,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|					И ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|							ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|							И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|						ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|									И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, 0) КАК ДнейПоСредней,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), ДЕНЬ) КАК ДнейВМесяце,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|			&КонПериода,
		|			Действует = ИСТИНА
		|				И ОбъектУстановки.Владелец = &Здание
		|				И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|				&КонПериода,
		|				Действует = ЛОЖЬ
		|					И ЕСТЬNULL(СреднемесячноеПоказание, 0) <> 0
		|					И ОбъектУстановки.Владелец = &Здание
		|					И ПриборУчета.Услуга = &Услуга) КАК НАПоверке
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = НАПоверке.ОбъектУстановки
		|			И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = НАПоверке.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	НАПоверке.СреднемесячноеПоказание <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектУстановки";
		
	Запрос.Параметры.Вставить("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.Параметры.Вставить("КонПериода", КонецМесяца(Объект.ПериодНачисления));
	
	Запрос.Параметры.Вставить("Здание", Объект.Здание);
	Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	
	Результат  = Запрос.ВыполнитьПакет();
	
	ВыборкаЛС = Результат[4].Выбрать(); 
	ВыборкаПоверок = Результат[5].Выбрать();
	Разница = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛицевыеСчета.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                |ГДЕ
	                |	ЛицевыеСчета.Владелец = &Здание
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Ссылка";
	Запрос.УстановитьПараметр("Здание",Объект.Здание);				 
	МассивОбъектовУстановки = ЗАпрос.Выполнить().Выгрузить();
	Пока ВыборкаЛС.Следующий() Цикл
		
				
		НоваяСтрока = Объект.Основная.Добавить();
		НоваяСтрока.ОбъектУстановки = ВыборкаЛС.ОбъектУстановки;
		НоваяСтрока.ПриборУчета = ВыборкаЛС.ПриборУчета;
		НоваяСтрока.ПоказаниеПредыдущее = ВыборкаЛС.ПоказаниеПредыдущее;
		НоваяСтрока.Показание = ВыборкаЛС.Показание;
		НоваяСтрока.Коэффициент = ВыборкаЛС.Коэффициент;
		НоваяСтрока.Отключен = ВыборкаЛС.Отключен;
		НоваяСтрока.ВидТарифа = ВыборкаЛС.ВидТарифа;
		НоваяСтрока.Услуга = ВыборкаЛС.Услуга;
		НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаЛС.ОбъектЛицевогоСчета;
		НоваяСтрока.ОтветственныйВладелец = ВыборкаЛС.ОтветственныйВладелец;
		НоваяСтрока.Разница = НоваяСтрока.Показание - НоваяСтрока.ПоказаниеПредыдущее;
				
	КонецЦикла;
	
	Для Индекс = 0 По (ЧИСЛО(МассивОбъектовУстановки.Количество())-1) Цикл
	
		НайденаПоверка = ВыборкаПоверок.НайтиСледующий(МассивОбъектовУстановки[Индекс].Ссылка);
		Если НайденаПоверка и ВыборкаПоверок.ДнейПоСредней <> 0 Тогда
			
		     
				НоваяСтрока = Объект.Основная.Добавить();
				НоваяСтрока.ОбъектУстановки = ВыборкаПоверок.ОбъектУстановки;
				НоваяСтрока.ПриборУчета = ВыборкаПоверок.ПриборУчета;
				НоваяСтрока.Коэффициент = ВыборкаПоверок.ПриборУчета.Коэффициент;
				НоваяСтрока.Отключен = Истина;
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Услуга =  ВыборкаПоверок.ПриборУчета.Услуга;
				НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаПоверок.ОбъектУстановки.ОбъектЛицевогоСчета;
				НоваяСтрока.ОтветственныйВладелец = ВыборкаПоверок.ОтветственныйВладелец;
				Разница = (ВыборкаПоверок.СреднемесячноеПоказание/(ВыборкаПоверок.ДнейВМесяце+1))*ВыборкаПоверок.ДнейПоСредней;
				НоваяСтрока.Разница =  Разница;

		 КонецЕсли;  
	
	КонецЦикла; 
		
	Объект.Основная.Сортировать("ОбъектУстановки, ПриборУчета, Отключен Убыв");   
	
	Для каждого СтрокаОсновная Из Объект.Основная Цикл
		
		Если СтрокаОсновная.Показание = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", СтрокаОсновная.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", СтрокаОсновная.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", СтрокаОсновная.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		СтрокаОсновная.Разница = СтруктураДанные.РасходПоПриборуУчета;
		СтрокаОсновная.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		СтрокаОсновная.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
	
	КонецЦикла;  	
	
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьВсеПриборыУчета(Команда)
	
	ЗаполнитьПриборыУчета();

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТекущийПриборУчета(Команда)
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьПриборыУчета(ТекущиеДанные.ПриборУчета);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные)
	
	СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ОсновнаяПоказаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", ТекущиеДанные.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", ТекущиеДанные.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", ТекущиеДанные.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);

			ТекущиеДанные.Показание = ПоказаниеПередРедактированием;
			
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.Источник = ПолучитьПеречисление();
		ТекущиеДанные.Разница = СтруктураДанные.РасходПоПриборуУчета;
		ТекущиеДанные.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		ТекущиеДанные.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОсновнаяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
   	Если Не ТекущиеДанные = Неопределено Тогда
    	ПоказаниеПередРедактированием = ТекущиеДанные.Показание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.Отключен Тогда
		
			Отказ = Истина;	
		
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		МассивСтрок = Объект.Основная.НайтиСтроки(Новый Структура("ПриборУчета", ТекущиеДанные.ПриборУчета));
		Если МассивСтрок.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из МассивСтрок Цикл
				Объект.Основная.Удалить(НайденнаяСтрока);
			КонецЦикла;
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказанияСчетчикаМоб(Команда)
	
	Если Объект.Основная.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Таблица показаний не заполнена! Перед загрузкой снятых показаний необходимо 
		|заполнить таблицу.";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Выполнено = Ложь;
	ЗаполнитьСМобильногоНаСервере(Выполнено);
	
	Если Выполнено Тогда
		ТекстВопроса = НСтр("ru='Задания успешно записаны';uk='Завдання успішно завантажені'");
		Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОК);	
		
		ПоказатьОповещениеПользователя(
		"Создание:",
		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
		Строка(Объект.Ссылка),
		БиблиотекаКартинок.Информация32);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСМобильногоНаСервере(Выполнено)

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СнятыеПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	              |	СнятыеПоказанияПриборовУчетаСрезПоследних.Значение
	              |ИЗ
	              |	РегистрСведений.СнятыеПоказанияПриборовУчета.СрезПоследних(
	              |			&Дата,
	              |			ПриборУчета В (&ПриборыУчета)
	              |				И Период >= НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ)) КАК СнятыеПоказанияПриборовУчетаСрезПоследних
	              |ГДЕ
	              |	СнятыеПоказанияПриборовУчетаСрезПоследних.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Объект.Исполнитель);
	Запрос.УстановитьПараметр("МесяцНачисления",Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("ПриборыУчета", Объект.Основная.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Результаты сбора показаний приборов учета отсутствуют'; uk = 'Результати збору показань приладів обліку відсутні'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	Пока Результат.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ПриборУчета,Отключен",Результат.ПриборУчета,Ложь);	
		Строка = Объект.Основная.НайтиСтроки(СтруктураПоиска);
		ПоказаниеПередРедактированием = Строка[0].Показание;
		Строка[0].Показание  = Результат.Значение;
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", Строка[0].ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", Строка[0].ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", Строка[0].Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);

			Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);

				Строка[0].Показание = ПоказаниеПередРедактированием;
			
				Возврат;
			КонецЕсли;
		
		Строка[0].Разница = СтруктураДанные.РасходПоПриборуУчета;
		Строка[0].ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		Строка[0].РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
		
	КонецЦикла;
	
	Выполнено = Истина;	
	
КонецПроцедуры // ЗаполнитьСМобильногоНаСервее()

&НаКлиенте
Процедура ЗаполнитьПокащанияСчечтикаExcel(Команда)
	
	Если Объект.Основная.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Таблица показаний не заполнена! Перед загрузкой снятых показаний необходимо 
						|заполнить таблицу.";
		Сообщение.Сообщить(); 
	    Возврат;
	КонецЕсли;
	
   АдресВременногоХранилища = ОткрытьФормуМодально("Документ.ВводПоказанийПриборовУчета.Форма.ФормаВыбораФайла");
   
   Если ЗначениеЗаполнено(АдресВременногоХранилища) тогда
	   ЗаполнитьПоказанияСчетчиковНаСервере(АдресВременногоХранилища);
   КонецЕсли;
   	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказанияСчетчиковНаСервере(АдресВременногоХранилища)

	ТаблицаПоказаний  = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Для Каждого Строка Из ТаблицаПоказаний Цикл
		
		СтруктураПоиска = Новый Структура("ПриборУчета,Отключен",Справочники.ПриборыУчета.НайтиПоНаименованию(Строка.ПриборУчета),Ложь);	
		Попытка
			СтрокаТаблицыДокумента = Объект.Основная.НайтиСтроки(СтруктураПоиска)[0];
			СтрокаТаблицыДокумента.Показание = Строка.Показание;
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ПриборУчета", СтрокаТаблицыДокумента.ПриборУчета);
			СтруктураДанные.Вставить("ПредыдущееПоказание", СтрокаТаблицыДокумента.ПоказаниеПредыдущее);
			СтруктураДанные.Вставить("ТекущееПоказание", СтрокаТаблицыДокумента.Показание);
			
			СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
			
			Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);
				
				СтрокаТаблицыДокумента.Показание = ПоказаниеПередРедактированием;
				
				Возврат;
			КонецЕсли;
			
			СтрокаТаблицыДокумента.Разница = СтруктураДанные.РасходПоПриборуУчета;
			СтрокаТаблицыДокумента.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
			СтрокаТаблицыДокумента.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
		Исключение
			Сообщить("Прибор "+Строка(Строка.ПриборУчета)+" отсутствует в табличной части документа");
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры // ()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИспользуетсяМобильноеПриложение = ПолучитьКонстанту();
	МобильныйАгент = Объект.Исполнитель;
	Если ИспользуетсяМобильноеПриложение Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) ИЛИ НЕ ЗначениеЗаполнено(Объект.ГраничнаяДатаСъема) Тогда
			
			Текст = НСтр("ru = 'Не выбран исполнитель или не заполнена граничная дата съема. 
                          |Продолжить?'; uk = 'Не вибраний виконавець або не заповнена гранична дата знімання. 
                          |Продовжити?'");
			Ответ = Вопрос(Текст,РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
			КонецЕсли;	
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКонстанту()

 Возврат Константы.ИспользоватьМобильноеПриложение.Получить();	

КонецФункции // ПолучитьКонстанту()

&НаКлиенте
Процедура ЗаполнитьПоказанияСчетчикаССайта(Команда)
	
	ЗаполнитьССайтаНаСервере();
   
КонецПроцедуры

&НаСервере
Функция ЗаполнитьССайтаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчетаССайта.Значение,
		|	ПоказанияПриборовУчетаССайта.ПриборУчета КАК ПриборУчета,
		|	ПоказанияПриборовУчетаССайта.ВидТарифа
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаССайта КАК ПоказанияПриборовУчетаССайта
		|ГДЕ
		|	ПоказанияПриборовУчетаССайта.Период >= &ДатаНач
		|	И ПоказанияПриборовУчетаССайта.Период <= &ДатаКон
		|	И ПоказанияПриборовУчетаССайта.ПриборУчета В(&ПриборыУчета)
		|	И ПоказанияПриборовУчетаССайта.ЛицевойСчет В(&ЛицевыеСчета)";
				  
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ПриборыУчета", Объект.Основная.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	Запрос.УстановитьПараметр("ЛицевыеСчета", Объект.Основная.Выгрузить().ВыгрузитьКолонку("ОбъектУстановки"));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Результаты сбора показаний приборов учета отсутствуют'; uk = 'Результати збору показань приладів обліку відсутні'");
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	
	Пока Результат.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ПриборУчета,Отключен,ВидТарифа",Результат.ПриборУчета,Ложь,Результат.ВидТарифа);	
		Строка = Объект.Основная.НайтиСтроки(СтруктураПоиска);
		Если Строка.Количество() <> 0 тогда
			ПоказаниеПередРедактированием = Строка[0].Показание;
			Строка[0].Показание  = Результат.Значение;
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ПриборУчета", Строка[0].ПриборУчета);
			СтруктураДанные.Вставить("ПредыдущееПоказание", Строка[0].ПоказаниеПредыдущее);
			СтруктураДанные.Вставить("ТекущееПоказание", Строка[0].Показание);
			
			СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
			
			Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);
				
				Строка[0].Показание = ПоказаниеПередРедактированием;
				
				Продолжить;
			КонецЕсли;
			
			Строка[0].Разница = СтруктураДанные.РасходПоПриборуУчета;
			Строка[0].ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
			Строка[0].РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
			Строка[0].ГрупповоеЗаполнение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;	
	
КонецФункции // ЗаполнитьССайтаНаСервее()

&НаКлиенте
Процедура ОсновнаяПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность()
	
КонецПроцедуры


&НаСервере
Функция  ОпределитьСтатусДокумента()

		Для каждого Строка  Из  Объект.Основная Цикл
			
			Если Строка.Показание = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;	
		
		Возврат Истина;

КонецФункции // ОпределитьСтатусДокумента()


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Закрыть(Записать());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеПоказания(Команда)
	
	Для каждого Строка Из Объект.Основная Цикл
	
		Если не ЗначениеЗаполнено(Строка.Показание) Тогда
			Строка.Показание = Строка.ПоказаниеПредыдущее;
		    Строка.Разница = 0;
		КонецЕсли;	
	
	КонецЦикла; 
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПеречисление()

	Возврат Перечисления.ИсточникиПоказаний.РучнаяОперация;

КонецФункции // ПолучитьПеречисление()

&НаСервере
Процедура ЗаполнитьПоказанияИзВсехИстониковНаСервере()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Значение,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.СайтЖКХ) КАК Источник
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаССайта.СрезПоследних(
		|			&ДатаКон,
		|			ПриборУчета В (&ПриборыУчета)
		|				И ЛицевойСчет В (&ЛицевыеСчета)) КАК ПоказанияПриборовУчетаССайтаСрезПоследних
		|ГДЕ
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период >= &ДатаНач
		|	И ПоказанияПриборовУчетаССайтаСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий),
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Значение,
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.МобильноеПриложение)
		|ИЗ
		|	РегистрСведений.СнятыеПоказанияПриборовУчета.СрезПоследних(&ДатаКон, ПриборУчета В (&приборыУчета)) КАК СнятыеПоказанияПриборовУчетаСрезПоследних
		|ГДЕ
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период >= &ДатаНач
		|	И СнятыеПоказанияПриборовУчетаСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.ПриборУчета,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.ВидТарифа,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Значение,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период,
		|	ВЫБОР
		|		КОГДА ПоказанияПУИзВнешнихИсточниковСрезПоследних.Источник = ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.ТаблицаExcel)
		|		ИНАЧЕ ПоказанияПУИзВнешнихИсточниковСрезПоследних.Источник
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПоказанияПУИзВнешнихИсточников.СрезПоследних(&ДатаКон, ПриборУчета В (&ПриборыУчета)) КАК ПоказанияПУИзВнешнихИсточниковСрезПоследних
		|ГДЕ
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период >= &ДатаНач
		|	И ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.Значение,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.Телеграм)
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм.СрезПоследних КАК ПоказанияПриборовУчетаИзТелеграммСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПриборУчета КАК ПриборУчета,
		|	ВТ.ВидТарифа КАК ВидТарифа,
		|	ВТ.Значение,
		|	ВТ.Период КАК Период,
		|	ВТ.Источник
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета,
		|	ВидТарифа,
		|	Период УБЫВ
		|ИТОГИ ПО
		|	ПриборУчета,
		|	ВидТарифа";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ПриборыУчета", Объект.Основная.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	Запрос.УстановитьПараметр("ЛицевыеСчета", Объект.Основная.Выгрузить().ВыгрузитьКолонку("ОбъектУстановки"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрибор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока  ВыборкаПрибор.Следующий() Цикл
		ВыборкаТариф = ВыборкаПрибор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  ВыборкаТариф.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ПриборУчета",ВыборкаТариф.ПриборУчета);
			СтруктураПоиска.Вставить("ВидТарифа",ВыборкаТариф.ВидТарифа);
			ВыборкаДетальныеЗаписи = ВыборкаТариф.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НайденныеСтроки = Объект.Основная.НайтиСтроки(СтруктураПоиска);
				Для каждого Строка Из НайденныеСтроки Цикл
				
					Если Строка.Отключен Тогда
						Продолжить;
					КонецЕсли;
					Строка.Показание = ВыборкаДетальныеЗаписи.значение;
					СтруктураДанные = Новый Структура();
					СтруктураДанные.Вставить("ПриборУчета", Строка.ПриборУчета);
					СтруктураДанные.Вставить("ПредыдущееПоказание", Строка.ПоказаниеПредыдущее);
					СтруктураДанные.Вставить("ТекущееПоказание", Строка.Показание);
					
					СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
					
					Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);
						
						Строка.Показание = ПоказаниеПередРедактированием;
						
						Возврат;
					КонецЕсли;
					Строка.Источник = ВыборкаДетальныеЗаписи.Источник;
					Строка.Разница = СтруктураДанные.РасходПоПриборуУчета;
					Строка.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
					Строка.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
					Прервать;
				
				КонецЦикла; 
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказанияИзВсехИстоников(Команда)
	ЗаполнитьПоказанияИзВсехИстониковНаСервере();
КонецПроцедуры
